{
  "testResults": [
    {
      "id": "e9df",
      "nickname": "유저T",
      "mbti": "ESTP",
      "visibility": true,
      "date": "2025-02-23",
      "description": "ESTP: 스릴을 즐기는 모험가! ESTP는 세상에서 재미있는 것을 찾고, 무엇이든 도전해보는 모험가입니다. 이들은 생각보다는 행동이 먼저인 사람들로, '해보지 않고는 모른다'라는 마인드를 가지고 있어요. 가끔은 너무 빨리 결정을 내려서 '아, 이거 왜 했지?'라고 후회할 때도 있긴 하지만, 그들은 이미 새로운 모험을 찾고 있을 거예요. 이들과 함께라면 지루할 틈이 없어요.",
      "userid": "qwertt"
    },
    {
      "id": "2bf8",
      "nickname": "유저A",
      "mbti": "ENTP",
      "visibility": true,
      "date": "2025-02-23",
      "description": "ENTP: 지적 도전을 즐기는 영리하고 호기심이 많은 사색가! ENTP은 두뇌 회전이 빠르고 대담한 성격으로 현재 상황에 이의를 제기하는 데 거리낌이 없는 사람들입니다. 이들은 어떤 의견이나 사람에 반대하는 일을 두려워하지 않으며, 논란이 될 만한 주제에 대해 격렬하게 논쟁하는 일을 즐기고 있어요. 그렇다고 반론을 제기하는 데만 관심이 있거나 악의를 지닌 것은 아니랍니다. ENTP는 사실 지식이 풍부하고 호기심이 넘치며 활기찬 유머 감각으로 다른 사람들을 즐겁게 할 수 있는 성격이랍니다.",
      "userid": "qwergg"
    },
    {
      "id": "d038",
      "nickname": "UserV",
      "mbti": "ENTJ",
      "visibility": false,
      "date": "2025-02-23",
      "description": "ENTJ: 천하를 호령하는 대장군! ENTJ는 타고난 리더입니다. 이들은 언제나 전략적으로 생각하며, 전쟁터에서 적을 무찌를 계획을 세우듯이 인생의 모든 측면에서 계획을 세워요. '목표는 달성하라고 있는 것'이란 마인드를 가진 이들은 무엇이든 해내고 말죠. 그러나 가끔은 너무 강하게 밀어붙여서 주변 사람들을 숨 막히게 할 때도 있어요. 그렇지만 이들의 결단력과 리더십은 정말 대단하답니다.",
      "userid": "qwervv"
    },
    {
      "id": "7715",
      "nickname": "유저T",
      "mbti": "INFP",
      "visibility": true,
      "date": "2025-02-23",
      "description": "INFP: 현실에서 방황하는 시인! INFP는 세상의 아름다움과 인간의 감정에 대해 깊이 생각하는 사람들입니다. 이들은 항상 자신의 마음속에서 새로운 시나 시를 짓고 있으며, 세상의 모든 슬픔과 기쁨을 시적으로 표현하고 싶어해요. 하지만 가끔은 현실과 약간 동떨어진 곳에 머무를 때가 있어서 '지금 내가 이걸 왜 하고 있지?'라고 스스로에게 묻곤 해요. 그럼에도 불구하고 이들은 정말 따뜻한 마음을 가진 친구들이에요.",
      "userid": "qwertt"
    },
    {
      "id": "976d",
      "nickname": "UseRR",
      "mbti": "ISFJ",
      "visibility": false,
      "date": "2025-02-23",
      "description": "ISFJ: 보이지 않는 수호천사! ISFJ는 조용히, 그러나 확실히 주변 사람들을 돕는 사람들입니다. 이들은 언제나 따뜻한 미소와 부드러운 말투로 주변 사람들을 돌보고 있으며, '도움이 필요하면 언제든지 말해!'라는 태도로 살아가죠. 그러나 가끔은 자신의 필요를 무시하고 다른 사람들을 우선시하다가 자신이 소진되기도 해요. 하지만 이들의 진정한 마음과 헌신은 세상을 따뜻하게 만든답니다.",
      "userid": "qwerrr"
    }
  ]
}